Revit 2024 API
ScheduleDefinition.RemoveSortGroupField Method
 Removes a sorting/grouping field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void RemoveSortGroupField(
	int index
)
Visual Basic
Public Sub RemoveSortGroupField ( _
	index As Integer _
)
Visual C++
public:
void RemoveSortGroupField(
	int index
)
Parameters
index
Type: System.Int32
 The index of the sorting/grouping field to remove.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  index is not a valid sorting/grouping field index.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace